---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.AnalysisParams
source: html/4c191d6a-f25f-1af2-2ce5-18343d28d4ce.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.AnalysisParams Property

Common set of parameters for structural analysis.

## Syntax (C#)
```csharp
public StructuralSectionAnalysisParams AnalysisParams { get; }
```